// /**
//
// Copyright (c) 2010, Intel Corporation . All rights reserved. <BR>
// This program and the accompanying materials
// are licensed and made available under the terms and conditions of the BSD License
// which accompanies this distribution. The full text of the license may be found at
// http://opensource.org/licenses/bsd-license.php
//
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
// Module Name:
//
// UefiShellCommandLib.uni
//
// Abstract:
//
// String definitions for UEFI Shell 2.0 ShellCommandLib
//
//
// **/

/=#

#langdef   en-US "english"

//
// Protocol names used making the GUID <-> Name bi-directional list
//

// basics Images & Device Path
#string STR_LOADED_IMAGE          #language en-US "Loaded Image"
#string STR_DEVICE_PATH           #language en-US "Device Path"
#string STR_IMAGE_PATH            #language en-US "Image Device Path"
#string STR_DEVICE_PATH_UTIL      #language en-US "Device Path Utilities"
#string STR_DEVICE_PATH_TXT       #language en-US "Device Path To Text"
#string STR_DEVICE_PATH_FTXT      #language en-US "Device Path From Text"
#string STR_DEVICE_PATH_PC        #language en-US "Device Path PC Ansi"
#string STR_DEVICE_PATH_VT100     #language en-US "Device Path VT100"
#string STR_DEVICE_PATH_VT100P    #language en-US "Device Path VT100+"
#string STR_DEVICE_PATH_VTUTF8    #language en-US "Device Path VTUTF8"

// Drivers
#string STR_DRIVER_BINDING        #language en-US "Driver Binding"
#string STR_PLATFORM_OVERRIDE     #language en-US "Platform Override"
#string STR_BUS_OVERRIDE          #language en-US "Bus Specific Driver Override"
#string STR_DRIVER_DIAG           #language en-US "Driver Diagnostics"
#string STR_DRIVER_DIAG2          #language en-US "Driver Diagnostics2"
#string STR_DRIVER_CN             #language en-US "Component Name"
#string STR_DRIVER_CN2            #language en-US "Component Name2"
#string STR_PLAT_DRV_CFG          #language en-US "Platform to Driver Configuration"
#string STR_DRIVER_VERSION        #language en-US "Driver Version"

// Console
#string STR_TXT_IN                #language en-US "Simple Text In"
#string STR_TXT_IN_EX             #language en-US "Simple Text InEx"
#string STR_TXT_OUT               #language en-US "Simple Text Out"
#string STR_SIM_POINTER           #language en-US "Simple Pointer"
#string STR_ABS_POINTER           #language en-US "Absolute Pointer"
#string STR_SERIAL_IO             #language en-US "Serial IO"
#string STR_GRAPHICS_OUTPUT       #language en-US "Graphics Output"
#string STR_EDID_DISCOVERED       #language en-US "EDID Discovered"
#string STR_EDID_ACTIVE           #language en-US "EDID Active"
#string STR_EDID_OVERRIDE         #language en-US "EDID Override"
#string STR_CON_IN                #language en-US "Console In"
#string STR_CON_OUT               #language en-US "Console Out"
#string STR_STD_ERR               #language en-US "StdErr"

// Media
#string STR_LOAD_FILE             #language en-US "Load File"
#string STR_LOAD_FILE2            #language en-US "Load File2"
#string STR_SIMPLE_FILE_SYS       #language en-US "Simple File System"
#string STR_FILE_INFO             #language en-US "File Info"
#string STR_FILE_SYS_INFO         #language en-US "File System Info"
#string STR_TAPE_IO               #language en-US "Tape IO"
#string STR_DISK_IO               #language en-US "Disk IO"
#string STR_BLK_IO                #language en-US "Block IO"
#string STR_UC                    #language en-US "Unicode Collation"
#string STR_UC2                   #language en-US "Unicode Collation2"

// PCI
#string STR_PCIRB_IO              #language en-US "PCI Root Bridge IO"
#string STR_PCI_IO                #language en-US "PCI IO"

// SCSI
#string STR_SCSI_PT               #language en-US "SCSI Pass Thru"
#string STR_SCSI_IO               #language en-US "SCSI IO"
#string STR_SCSI_PT_EXT           #language en-US "Extended SCSI Pass Thru"

// iSCSI
#string STR_ISCSI                 #language en-US "iSCSI Initiator Name"

// USB
#string STR_USB_IO                #language en-US "USB IO"
#string STR_USB_HC                #language en-US "USB Host Controler"
#string STR_USB_HC2               #language en-US "USB Host Controller2"

// Debug
#string STR_DEBUG_SUPPORT         #language en-US "Debug Support"
#string STR_DEBUG_PORT            #language en-US "Debug Port"

#string STR_DECOMPRESS            #language en-US "Decompress"

#string STR_ACPI_TABLE            #language en-US "Acpi Table"

#string STR_EBC_INTERPRETER       #language en-US "EBC Interpreter"

// Network
#string STR_SNP                   #language en-US "Simple Network"
#string STR_NII                   #language en-US "Network Interface Identifier"
#string STR_NII_31                #language en-US "Network Interface Identifier 31"
#string STR_PXE_BC                #language en-US "PXE Base Code"
#string STR_PXE_CB                #language en-US "PXE Callback"
#string STR_BIS                   #language en-US "BIS"
#string STR_MNP_SB                #language en-US "Managed Network Service Binding"
#string STR_MNP                   #language en-US "Managed Network"

#string STR_ARP_SB                #language en-US "ARP Service Binding"
#string STR_ARP                   #language en-US "ARP"
#string STR_DHCPV4_SB             #language en-US "DHCPv4 Service Binding"
#string STR_DHCPV4                #language en-US "DHCPv4"
#string STR_TCPV4_SB              #language en-US "TCPv4 Service Binding"
#string STR_TCPV4                 #language en-US "TCPv4"
#string STR_IPV4_SB               #language en-US "IPv4 Service Binding"
#string STR_IPV4                  #language en-US "IPv4"
#string STR_IPV4_CFG              #language en-US "IPv4 Config"
#string STR_UDPV4_SB              #language en-US "UDPv4 Service Binding"
#string STR_UDPV4                 #language en-US "UDPv4"
#string STR_MTFTPV4_SB            #language en-US "MTFTPv4 Service Binding"
#string STR_MTFTPV4               #language en-US "MTFTPv4"

// Security
#string STR_HASH_SB               #language en-US "Hash Service Binding"
#string STR_HASH                  #language en-US "Hash"
#string STR_AUTH_INFO             #language en-US "Authentication Info"

// HII
#string STR_HII_FONT              #language en-US "HII Font"
#string STR_HII_STRING            #language en-US "HII String"
#string STR_HII_IMAGE             #language en-US "HII Image"
#string STR_HII_DATABASE          #language en-US "HII Database"
#string STR_HII_CONFIG_ROUT       #language en-US "HII Config Routing"
#string STR_HII_CONFIG_ACC        #language en-US "HII Config Access"
#string STR_HII_FORM_BROWSER2     #language en-US "HII Form Browser2"

// Shell
#string STR_SHELL_PARAMETERS      #language en-US "Shell Parameters"
#string STR_SHELL                 #language en-US "Shell"

#string STR_EFI_GLOBAL_VARIABLE   #language en-US "EFI Global Variable"

// NT32 emulation
#string STR_WINNT_THUNK           #language en-US "WinNT Thunk"
#string STR_WINNT_DRIVER_IO       #language en-US "WinNT Driver IO"
#string STR_WINNT_SERIAL_PORT     #language en-US "WinNT Serial Port"

#string STR_UNKNOWN_DEVICE        #language en-US "Unknown Device"

// deprecated protocols
#string STR_SHELL_INTERFACE       #language en-US "Shell Interface"
#string STR_SHELL_ENV             #language en-US "Shell Environment"
#string STR_SHELL_ENV2            #language en-US "Shell Environment2"
#string STR_SHELL_DP_MAP          #language en-US "Shell Device Path Map"
#string STR_SHELL_ALIAS           #language en-US "Shell Alias"
#string STR_DEVICE_IO             #language en-US "Device IO"
#string STR_TCP                   #language en-US "TCP"
#string STR_UGA_DRAW              #language en-US "UGA Draw"
#string STR_UGA_IO                #language en-US "UGA IO"
#string STR_ESP                   #language en-US "EFI System Partition"
#string STR_GPT_NBR               #language en-US "Legacy MBR"
#string STR_DRIVER_CONFIG         #language en-US "Driver Configuration"
#string STR_DRIVER_CONFIG2        #language en-US "Driver Configuration2"
#string STR_ISA_IO                #language en-US "ISA IO"
#string STR_ISA_ACPI              #language en-US "ISA ACPI"
#string STR_HII_FORM_BROWSER      #language en-US "HII Form Browser"
#string STR_HII                   #language en-US "HII"
#string STR_HII_FORM_CALLBACK     #language en-US "HII Callback"























